# Purpose

Students have the option of using Pandas and SQL to complete this project. A Phase 1 project done completely in pandas, completely in SQL, or a mixture of the two can all be considered a fine Phase 1 project. This notebook serves as a resource for setting up an SQL database for students who wish to use SQL in their Phase 1 project.

**To create the `movies.db` database, run the code cells below.**
> The Entity Relational Diagram is below

In [59]:
from src.make_db import create_movies_db

In [60]:
create_movies_db()

imdb_title_principals table created successfully....
imdb_name_basic table created successfully....
imdb_title_crew table created successfully....
imdb_title_ratings table created successfully....
imdb_title_basics table created successfully....
imdb_title_akas table created successfully....
tn_movie_budgets table created successfully....
tmdb_movies table created successfully....
bom_movie_gross table created successfully....
rotten_tomatoes_critic_reviews table created successfully....
rotten_tomatoes_movies table created successfully....
=========================================================
Inserting data into the imdb_title_crew table....
Inserting data into the tmdb_movies table....
Inserting data into the imdb_title_akas table....
Inserting data into the imdb_title_ratings table....
Inserting data into the imdb_name_basics table....
Inserting data into the rotten_tomatoes_movies table....
Inserting data into the rotten_tomatoes_critic_reviews table....
Inserting data into the imdb_title_basics table....
Inserting data into the tn_movie_budgets table....
Inserting data into the bom_movie_gross table....
Inserting data into the imdb_title_principals table....
=========================================================
Database created successfully!
To connect to the database: open a connection using the path "data/movies.db"

![movies.db schema](images/movies_db_schema.png)

In [2]:
import sqlite3
import pandas as pd
conn = sqlite3.connect("data/movies.db")

In [3]:
pd.read_sql("""
SELECT *
FROM tn_movie_budgets
""", conn)

,idx,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...,...
5777,5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [4]:
df = pd.read_sql("""
SELECT *
FROM tn_movie_budgets
""", conn)
df.head()

,idx,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [5]:
df["production_budget"] = df["production_budget"].apply(lambda x: int(x.replace("$", "").replace(",", "")))
df["domestic_gross"] = df["domestic_gross"].apply(lambda x: int(x.replace("$", "").replace(",", "")))
df["worldwide_gross"] = df["worldwide_gross"].apply(lambda x: int(x.replace("$", "").replace(",", "")))
df

,idx,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279
1,1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350
3,3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963
4,4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747
...,...,...,...,...,...,...,...
5777,5777,78,"Dec 31, 2018",Red 11,7000,0,0
5778,5778,79,"Apr 2, 1999",Following,6000,48482,240495
5779,5779,80,"Jul 13, 2005",Return to the Land of Wonders,5000,1338,1338
5780,5780,81,"Sep 29, 2015",A Plague So Pleasant,1400,0,0
5781,5781,82,"Aug 5, 2005",My Date With Drew,1100,181041,181041

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   idx                5782 non-null   int64
 1   id                 5782 non-null   int64
 2   release_date       5782 non-null   object
 3   movie              5782 non-null   object
 4   production_budget  5782 non-null   int64
 5   domestic_gross     5782 non-null   int64
 6   worldwide_gross    5782 non-null   int64
dtypes: int64(5), object(2)
memory usage: 316.3+ KB

In [7]:
df["domestic_profit"] = df["domestic_gross"] - df["production_budget"]
df["worldwide_profit"] = df["worldwide_gross"] - df["production_budget"]
df.head()

,idx,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_profit,worldwide_profit
0,0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,335507625,2351345279
1,1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,-169536125,635063875
2,2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,-307237650,-200237650
3,3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,128405868,1072413963
4,4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,303181382,999721747

In [8]:
df.to_sql("tn_movie_budgets_better", conn)

ValueError: Table 'tn_movie_budgets_better' already exists.

In [9]:
pd.read_sql("""
SELECT *
FROM tn_movie_budgets_better
ORDER BY worldwide_profit DESC
""", conn)

,index,idx,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_profit,worldwide_profit
0,0,0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,335507625,2351345279
1,42,42,43,"Dec 19, 1997",Titanic,200000000,659363944,2208208395,459363944,2008208395
2,6,6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200,378815482,1748134200
3,5,5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,630662225,1747311220
4,33,33,34,"Jun 12, 2015",Jurassic World,215000000,652270625,1648854864,437270625,1433854864
...,...,...,...,...,...,...,...,...,...,...
5777,352,352,53,"Apr 27, 2001",Town & Country,105000000,6712451,10364769,-98287549,-94635231
5778,341,341,42,"Jun 14, 2019",Men in Black: International,110000000,3100000,3100000,-106900000,-106900000
5779,193,193,94,"Mar 11, 2011",Mars Needs Moms,150000000,21392758,39549758,-128607242,-110450242
5780,194,194,95,"Dec 31, 2020",Moonfall,150000000,0,0,-150000000,-150000000
5781,2,2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,-307237650,-200237650

In [10]:
pd.read_sql("""
SELECT DISTINCT movie, worldwide_profit, genres, runtime_minutes
FROM tn_movie_budgets_better
INNER JOIN imdb_title_basics
    ON tn_movie_budgets_better.movie = imdb_title_basics.primary_title
ORDER BY worldwide_profit
""", conn)

,movie,worldwide_profit,genres,runtime_minutes
0,Dark Phoenix,-200237650,"Action,Adventure,Sci-Fi",113.0
1,Mars Needs Moms,-110450242,"Adventure,Animation,Family",88.0
2,Men in Black: International,-106900000,"Action,Adventure,Comedy",115.0
3,Bright,-90000000,"Action,Crime,Fantasy",117.0
4,Call of the Wild,-82000000,"Adventure,Animation,Family",NaN
...,...,...,...,...
3777,Jurassic World,1433854864,"Action,Adventure,Sci-Fi",124.0
3778,Avengers: Infinity War,1748134200,"Action,Adventure,Sci-Fi",149.0
3779,Titanic,2008208395,Adventure,NaN
3780,Titanic,2008208395,Family,115.0
3781,Avatar,2351345279,Horror,93.0

In [11]:
df = pd.read_sql("""
SELECT *
FROM imdb_title_basics
""", conn).dropna(subset = ['original_title'])
df

,idx,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...,...
146139,146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [12]:
pd.read_sql("""
SELECT *
FROM imdb_title_basics
WHERE primary_title = 'Ângelo de Sousa - Tudo o Que Sou Capaz'
""", conn)

,idx,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,66989,tt3815122,Ângelo de Sousa - Tudo o Que Sou Capaz,Ângelo de Sousa - Tudo o Que Sou Capaz,2010,60.0,"Biography,Documentary"
1,66990,tt3815124,Ângelo de Sousa - Tudo o Que Sou Capaz,Ângelo de Sousa - Tudo o Que Sou Capaz,2010,60.0,"Biography,Documentary"
2,66991,tt3815126,Ângelo de Sousa - Tudo o Que Sou Capaz,Ângelo de Sousa - Tudo o Que Sou Capaz,2010,60.0,"Biography,Documentary"
3,66992,tt3815128,Ângelo de Sousa - Tudo o Que Sou Capaz,Ângelo de Sousa - Tudo o Que Sou Capaz,2010,60.0,"Biography,Documentary"
4,66993,tt3815130,Ângelo de Sousa - Tudo o Que Sou Capaz,Ângelo de Sousa - Tudo o Que Sou Capaz,2010,60.0,"Biography,Documentary"
5,66994,tt3815132,Ângelo de Sousa - Tudo o Que Sou Capaz,Ângelo de Sousa - Tudo o Que Sou Capaz,2010,60.0,"Biography,Documentary"
6,66995,tt3815134,Ângelo de Sousa - Tudo o Que Sou Capaz,Ângelo de Sousa - Tudo o Que Sou Capaz,2010,60.0,"Biography,Documentary"

In [13]:
df = df.set_index(df["idx"])
df

,idx,tconst,primary_title,original_title,start_year,runtime_minutes,genres
idx,,,,,,,
0,0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...,...
146139,146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [14]:
df = df.drop(columns = ["idx", "tconst", "original_title"])
df

,primary_title,start_year,runtime_minutes,genres
idx,,,,
0,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,One Day Before the Rainy Season,2019,114.0,"Biography,Drama"
2,The Other Side of the Wind,2018,122.0,Drama
3,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,The Wandering Soap Opera,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...
146139,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,Dankyavar Danka,2013,NaN,Comedy
146142,6 Gunn,2017,116.0,None
146143,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [15]:
df.drop_duplicates()

,primary_title,start_year,runtime_minutes,genres
idx,,,,
0,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,One Day Before the Rainy Season,2019,114.0,"Biography,Drama"
2,The Other Side of the Wind,2018,122.0,Drama
3,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,The Wandering Soap Opera,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...
146139,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,Dankyavar Danka,2013,NaN,Comedy
146142,6 Gunn,2017,116.0,None
146143,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [16]:
df["genres"] = df["genres"].apply(lambda x: x.split(",") if type(x) == str else x)
df

,primary_title,start_year,runtime_minutes,genres
idx,,,,
0,Sunghursh,2013,175.0,"[Action, Crime, Drama]"
1,One Day Before the Rainy Season,2019,114.0,"[Biography, Drama]"
2,The Other Side of the Wind,2018,122.0,[Drama]
3,Sabse Bada Sukh,2018,NaN,"[Comedy, Drama]"
4,The Wandering Soap Opera,2017,80.0,"[Comedy, Drama, Fantasy]"
...,...,...,...,...
146139,Kuambil Lagi Hatiku,2019,123.0,[Drama]
146140,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,[Documentary]
146141,Dankyavar Danka,2013,NaN,[Comedy]
146142,6 Gunn,2017,116.0,None
146143,Chico Albuquerque - Revelações,2013,NaN,[Documentary]

In [17]:
df.isna().sum()

primary_title          0
start_year             0
runtime_minutes    31722
genres              5389
dtype: int64

In [22]:
df = df.dropna(subset = ["genres"])

In [23]:
df.isna().sum()

primary_title          0
start_year             0
runtime_minutes    28502
genres                 0
dtype: int64